app/views/home/class.html.erb

        <td class="label"> Dönem: </td>
        <td class="field"><%= select_tag(:period_id, options_from_collection_for_select(Period.all, :id, :full_name)) %></td>
---
SELECT `periods`.* FROM `periods`

        <td class="label"> Sınıflar: </td>
        <td class="field"><%= select_tag(:classroom_id, options_from_collection_for_select(Classroom.all, :id, :name)) %></td>
---
SELECT `classrooms`.* FROM `classrooms` ORDER BY name