app/views/home/index.html.erb

<%
  if period = Period.find(:first, :conditions => {:status => true})
---
SELECT `periods`.* FROM `periods` WHERE `periods`.`status` = 1 LIMIT 1

    <br />
    <% departments = Department.where('id not in (?)', 19) %>
---
SELECT `departments`.* FROM `departments` WHERE `departments`.`id` = 19 LIMIT 1

                <td><%= department.name %> </td>
                <th><%= Lecturer.where(:department_id => department.id).count %></th>
                <th><%= Course.where(:department_id => department.id).count %></th>
---
SELECT COUNT(*) FROM `lecturers` WHERE `lecturers`.`department_id` = 1
SELECT COUNT(*) FROM `courses` WHERE `courses`.`department_id` = 1

          <ul id="ticker" class="ticker" style="width:300px;height:185px">
            <% Notice.all.each do |notice| %>
---
SELECT `notices`.* FROM `notices`

            <tr>
              <td>Toplam Bölüm Sayısı</td><th><%= Department.count-1 %></th>
---
SELECT COUNT(*) FROM `departments`

            <tr>
              <td>Toplam Öğretim Üyesi Sayısı</td><th><%= Lecturer.count %></th>
---
SELECT COUNT(*) FROM `lecturers`

            <tr>
              <td>Toplam Ders Sayısı</td><th><%= Course.count %></th>
---
SELECT COUNT(*) FROM `courses`

            <tr>
              <td>Sistem Yöneticisi Sayısı</td><th><%= People.where(:status => 0).count %></th>
---
SELECT COUNT(*) FROM `people` WHERE `people`.`status` IN (1, 2, 3)

            <tr>
              <td>Toplam Kullanıcı Sayısı</td><th><%= People.count %></th>
---
SELECT COUNT(*) FROM `people`