app/views/home/lecturer.html.erb

      <td class="label"> Dönem: </td>
      <td class="field"><%= select_tag(:period_id, options_from_collection_for_select(Period.all, :id, :full_name)) %></td>
---
SELECT `periods`.* FROM `periods`

      <td class="label"> Bölüm: </td>
      <td class="field"><%= select_tag(:department_id, options_from_collection_for_select(Department.all, :id, :name)) %></td>
---
SELECT `departments`.* FROM `departments`