app/controllers/admin_controller.rb

SELECT `people`.* FROM `people` WHERE `people`.`first_name` IS NULL AND `people`.`password` IS NULL AND `people`.`status` = 0 AND `people`.`department_id` = 0 LIMIT 1
---
  def login
    redirect_to '/admin/home' if session[:admin]

    if admin = People.find(:first, :conditions => { :first_name => params[:first_name], :password => params[:password] })
      if admin.department_id == 0 and admin.status == 0
        session[:error] = nil
        session[:admin] = true
        session[:admindepartment] = admin.department_id
        session[:adminusername] = admin.first_name